---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SymbolNameParam
source: html/91a00b03-40ef-3411-61a8-fd4cee173e92.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SymbolNameParam Property

"Type Name"

## Syntax (C#)
```csharp
public static ForgeTypeId SymbolNameParam { get; }
```